KEYWORD_CONFIG = {
    "fragile": {
        "name": "易碎",
        "desc": "在一场战斗中如果被打出超过指定次数则会直接碎裂，并从牌组中永久移除"
    },
    "recall_dead_minion": {
        "name": "死者召回",
        "desc": "从我方随从墓地中随机选择一个生命值上限低于指定限制的已阵亡随从，重新召唤并部署到我方战场上"
    },
    "exhaust": {
        "name": "消耗",
        "desc": "卡牌被打出或触发后不进入弃牌堆，而是移入消耗堆，在本次战斗中离场"
    },
    "ethereal": {
        "name": "虚无",
        "desc": "卡牌在回合结束时如果仍保留在手牌中，则会被自动移入消耗堆消耗"
    },
    "retain": {
        "name": "保留",
        "desc": "卡牌在回合结束时不会被丢弃到弃牌堆，而是继续保存在手牌中"
    },
    "agile": {
        "name": "灵巧",
        "desc": "卡牌如果因为其他卡牌或效果被主动从手牌中丢弃时，会自动免费打出并触发其效果"
    },
    "fleeting": {
        "name": "即逝",
        "desc": "卡牌一旦在战斗中被打出，会直接从玩家大牌组中彻底移除，局后不再拥有"
    },
    "innate": {
        "name": "固有",
        "desc": "在战斗开始时，该卡牌必定会加入玩家的初始手牌中"
    },
    "unplayable": {
        "name": "不能被打出",
        "desc": "卡牌在手牌中时无法被玩家主动打出，通常需要通过被动触发或被丢弃处理"
    },
    "ward": {
        "name": "守护",
        "desc": "拥有守护状态的随从在战场上时，敌方的单体指向性攻击意图将被强制吸引并只能指向该随从"
    },
    "replay": {
        "name": "重放",
        "desc": "卡牌被打出时，会按照指定的重放层数额外自动重复打出对应次数，此重复释放不消耗额外的行动点与能量"
    },
    "collaboration": {
        "name": "协作",
        "desc": "本场战斗中我方累计召唤随从的总次数。许多士兵与指挥官随从会根据当前协作值的高低触发强力的额外入场曲或在场效果"
    },
    "copy": {
        "name": "复制",
        "desc": "卡牌被打出时，会往你的手牌中添加指定数量的去除了复制属性的该卡牌复制品，用于在此后进行连击，添加的数量不能超过手牌上限"
    },
    "return": {
        "name": "返回",
        "desc": "卡牌在打出后，会自动重新回到玩家的手牌中，而不是进入弃牌堆，回弹次数由词条参数决定"
    },
    "fanfare": {
        "name": "入场曲",
        "desc": "随从卡牌从手牌中被打出，召唤部署到我方战场上时触发的特殊效果"
    },
    "last_words": {
        "name": "谢幕曲",
        "desc": "随从在战场上阵亡、或护符因为吟唱时间结束而被销毁时触发的被动结算效果"
    },
    "countdown": {
        "name": "吟唱",
        "desc": "护符部署于战场后具有的默认倒计时。在每个我方回合开始时吟唱时间减少 1，直至归零销毁并触发其谢幕曲"
    },
    "disappear": {
        "name": "消失",
        "desc": "直接从战场上移除指定单位或护符，使其彻底离场，在此过程中不触发该实体的任何谢幕曲被动效果，且不进入对应的墓地"
    },
    "destroy": {
        "name": "破坏",
        "desc": "将战场上的随从或护符强制摧毁，使其进入阵亡/销毁结算流程，这会正常触发其被动的谢幕曲效果，且随从会进入随从墓地"
    }
}

