SHOP_ITEMS = {
    "时序法师": {
        "price": 2888,
        "desc": "操控时间。开局获得专属传奇卡牌“时间停止”（追加 3 个额外回合）。"
    },
    "塑能法师": {
        "price": 2888,
        "desc": "元素爆发。所有法术伤害提升 15%，且抓取火球术时 40% 几率将火球术替换为流星爆。"
    },
    "秘钥学者": {
        "price": 2888,
        "desc": "门扉共鸣。打出护符时回复 3 生命且获得 4 护盾。抓取卡牌时 35% 几率将普通法术替换为“秘钥共鸣”。"
    },
    "门之钥匙": {
        "price": 2000,
        "desc": "传说之钥。开启先古之门，20层击败BOSS后可进入5层长的“先古境地”！"
    },
    "神秘物品": {
        "price": 66666,
        "desc": "一件蕴藏着奇异力量的物件，购买后会永久保存在收藏中。"
    }
}
